src/InformationRegisters/Профосмотры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>Профосмотры</Name>
			<Comment>Хранит историю проведения и планирования профосмотров</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДатаЗапланированная</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПрофосмотров</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Сделка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сделки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредварительнаяЗапись</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Событие</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаОтказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прием</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Прием</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаправившийВрач</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АвторЗаписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаНаправления</Name>
					<Comment>Причина направления к врачу</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПричинаПереноса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПричиныОтменыЗаписи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Длительность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Специализация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Специализации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидОсмотра</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОсмотров</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/НастройкиСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>НастройкиСотрудников</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ассистент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПриема</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаУвольнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОсновнойШаблонОбследований</Name>
					<Comment>Основной шаблон обследований</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныОбследований</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РазрешитьПриемНесколькихПациентов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СегментыНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальнаяРучнаяСкидка</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтруктурнаяЕдиница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/ВидыОсмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОсмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Направление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОчередьНаЗапись</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Профосмотр</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторныйПрием</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СтатусыПрофосмотров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыПрофосмотров</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирован</Name>
					<Comment>Запланирован</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласился</Name>
					<Comment>Согласился</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапомнитьПозже</Name>
					<Comment>Напомнить позже</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отказался</Name>
					<Comment>Отказался</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ДоступныеПериодыОтчета.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ДоступныеПериодыОтчета</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>День</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Неделя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Декада</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Месяц</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Квартал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Полугодие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Год</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроизвольныйПериод</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ПолФизическогоЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ПолФизическогоЛица</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Мужской</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Женский</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/ТипыКонтрагентов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтрагентов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Лаборатория</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поставщик</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтраховаяКомпания</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КорпоративныеКонтрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГосОрган</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/РольПользователя.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>РольПользователя</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Руководитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Управляющий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Бухгалтер</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГлавныйВрач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Врач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ассистент</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Регистратура</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СестраХозяйка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АдминистраторБазыДанных</Name>
					<Comment>Администратор базы данных</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/Профосмотры/Forms/ФормаНаправлениеНаПрием/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем ИскомыйКлиент;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
// Обработчик создания формы
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ЭтоОчередьНаЗапись") Тогда
		Параметры.Свойство("ДатаЗапланированная", Запись.ДатаЗапланированная);			
		Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись;		
	Иначе 			
		Параметры.Свойство("Прием"              , Запись.Прием);
		Запись.ВидОсмотра = Перечисления.ВидыОсмотров.Направление;	
	КонецЕсли;
	
	Параметры.Свойство("СтруктурнаяЕдиница" , Запись.СтруктурнаяЕдиница);
	Параметры.Свойство("Сотрудник"          , Запись.Сотрудник);
	Параметры.Свойство("Контрагент"         , Запись.Контрагент);
	
	Запись.Период              = ТекущаяДата();
	Запись.АвторЗаписи         = ПараметрыСеанса.ТекущийПользователь;
	Запись.Статус              = Перечисления.СтатусыПрофосмотров.Запланирован;	
	
	УстановитьСостояниеФормы();
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ЗаполнитьСписокВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
		
	УстановитьДоступностьЭлементов(); 
	
	ЭтотОбъект.КлючСохраненияПоложенияОкна = Новый УникальныйИдентификатор();
	
КонецПроцедуры

&НаСервере
// Обработчик перед записью данных на сервере
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)	
	
	Если ЗначениеЗаполнено(ТекущийОбъект.ПредварительнаяЗапись) Тогда
		ТекущийОбъект.Статус = Перечисления.СтатусыПрофосмотров.Согласился;
	Иначе
		ТекущийОбъект.Статус = Перечисления.СтатусыПрофосмотров.Запланирован;
	КонецЕсли;
	
	Если ТекущийОбъект.ВидОсмотра = Перечисления.ВидыОсмотров.Направление Тогда 
		ТекущийОбъект.ДатаЗапланированная = ТекущаяДата();
	КонецЕсли;	
	
КонецПроцедуры

&НаСервере
// Обработчик при записи на сервре
//
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// Сохранение вводимых значений
	СохранениеВводимыхЗначений.ОбновитьСпискиВыбора(ЭтаФорма, ЭлементыДляСохранения(), ЭтаФорма.ИмяФормы);
	
КонецПроцедуры

&НаКлиенте
// Обработчик этой формы о записи новго объекта созданного из этой формы
//
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	
	Если ТипЗнч(НовыйОбъект.Ссылка) = Тип("ДокументСсылка.Событие") Тогда
		Запись.ПредварительнаяЗапись = НовыйОбъект.Ссылка;
		Если ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда
			Элементы.ДекорацияЗаписьНаПрием.Заголовок = СформироватьПредставлениеПЗ(Запись.ПредварительнаяЗапись);
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Создать запись на прием
//
Процедура ДекорацияЗаписьНаПриемНажатие(Элемент)
	
	// Если предварительная запись еще не создана откр. форму создания	
	Если НЕ ЗначениеЗаполнено(Запись.ПредварительнаяЗапись) Тогда	
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("Дата"                    ,ТекущаяДата());
		ПараметрыФормы.Вставить("Контрагент"              ,Запись.Контрагент);
		ПараметрыФормы.Вставить("Сотрудник"               ,Запись.Сотрудник);
		ПараметрыФормы.Вставить("ЗакрытьПриСозданииЗаписи",Истина);
		ПараметрыФормы.Вставить("ПереключательПериода" , ПредопределенноеЗначение("Перечисление.ДоступныеПериодыОтчета.Неделя")); 
		
		ИмяФормыПланировщика = ОбщегоНазначенияКлиент.ПолучитьИмяФормыПланировщика(ПараметрыФормы, "ФормаПредварительнойЗаписи");
		ОткрытьФорму(ИмяФормыПланировщика, ПараметрыФормы,, Новый УникальныйИдентификатор,,,,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

		// ОткрытьФорму("Обработка.РабочийКалендарь.Форма.ФормаПредварительнойЗаписи",ПараметрыФормы,ЭтаФорма);
	Иначе
		// Если предварительная запись создана открываем форму доккумента
		ПерейтиПоНавигационнойСсылке(ПолучитьНавигационнуюСсылку(Запись.ПредварительнаяЗапись));
	КонецЕсли;
	
КонецПроцедуры

// Процедура, обработчик события элемента "СотрудникПриИзменении".
//
// Параметры:
//  Элемент	 - 	 - 
//
&НаКлиенте
// Процедура, обработчик события элемента "СотрудникПриИзменении".
//
Процедура СотрудникПриИзменении(Элемент)
	
	УстановитьДоступностьЭлементов();
	
КонецПроцедуры

///////////////////////////////////////////////////////////////////////////////////
// СПЕЦИАЛЬНЫЕ ОБРАБОТЧИКИ

&НаКлиенте
// Обработчик открытия формы кэш списка вводимых значений 
//
Процедура Подключаемый_ОбработчикКэшЛист(Элемент, ДанныеВыбора, СтандартнаяОбработка) Экспорт
	
	СтандартнаяОбработка = Ложь;
	СохранениеВводимыхЗначенийКлиент.ОбработчикВызоваФормыРедактированияКэшСписка(Элемент,ЭтаФорма);
	
КонецПроцедуры 

&НаКлиенте
// Процедура, оповещение "ПослеВыбораПользователяКэшЛист".
//
Процедура ПослеВыбораПользователяКэшЛист(Закрытие, Параметры) Экспорт 
	
	Если Закрытие <> Неопределено Тогда
		Запись.ПричинаНаправления = Закрытие;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции  

///////////////////////// ДОРПОЛНИТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ ////////////////////////////

&НаСервереБезконтекста
// Сформировать представление ссылки на ПЗ
//
Функция СформироватьПредставлениеПЗ(ДокСсылка)	
	
	Если ДокСсылка.Услуги.Количество() > 0 Тогда
		Возврат "Запись на " + Формат(ДокСсылка.Услуги[0].ДатаНачала,"ДФ='dd MMMM yyyy H:mm'"); 
	Иначе
		Возврат Строка(ДокСсылка);
	КонецЕсли;
	
КонецФункции

&НаСервере
// Веренет таблицу сохраняемых элементов
//
Функция ЭлементыДляСохранения()                     
	
	Если Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда		
		СохраняемыеЭлементы = Новый Структура("ПричинаДобавления", Запись.ПричинаНаправления);  		
	Иначе 
		СохраняемыеЭлементы = Новый Структура("ПричинаНаправления", Запись.ПричинаНаправления);  
	КонецЕсли;
	
	Возврат СохранениеВводимыхЗначений.СформироватьТаблицуСохраненяемыхЭлементов(СохраняемыеЭлементы);
	
КонецФункции

&НаСервере
//
//
Процедура УстановитьСостояниеФормы()
	
	Если Запись.ВидОсмотра = Перечисления.ВидыОсмотров.ОчередьНаЗапись Тогда 
		ЭтаФорма.Заголовок = "Добавление в очередь на запись";
		Элементы.ДекорацияЗаписьНаПрием.Видимость = Ложь;
		Элементы.ПричинаНаправления.Видимость = Ложь;
		Элементы.ПричинаДобавления.Видимость = Истина;
		Элементы.ДатаПриема.Видимость = Истина;
		Элементы.ДатаПриема.Ширина = 7;
	Иначе 
		Элементы.ПричинаНаправления.Видимость = Истина;
		Элементы.ПричинаДобавления.Видимость = Ложь;
	КонецЕсли;	
	
	Если Запись.Контрагент.Пустая() Тогда 
		Элементы.Контрагент.ТолькоПросмотр = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка) 
	
	Если ВыбранноеЗначение = "СоздатьНовогоКлиента" Тогда
		ДобавитьИВыбратьКонтрагента(Неопределено);
		ВыбранноеЗначение = Запись.Контрагент;
	КонецЕсли;	 
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентАвтоПодбор(Элемент, Текст, ДанныеВыбора, Параметры, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИскомыйКлиент = Текст;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, 10, Истина, Истина);

КонецПроцедуры

&НаКлиенте
Процедура КонтрагентОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, Параметры, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
	ДанныеВыбора = ОбщегоНазначенияСтоматология.НайтиКонтрагентовПоСтроке(Текст, , Истина, Истина);	

КонецПроцедуры

&НаКлиенте
// Процедура, обработчик команды ДобавитьИВыбратьКонтрагента 
//
Процедура ДобавитьИВыбратьКонтрагента(Команда)
	
	ПараметрыОткрытия = Новый Структура;

	ГруппаКлиентов = ОбщегоНазначенияСтоматология.ВернутьГруппуКлиентов();
	Если ЗначениеЗаполнено(ГруппаКлиентов) Тогда
		Родитель = ГруппаКлиентов;
	Иначе
		Родитель = ГруппаКонтрагентов();
	КонецЕсли;
	
	ПараметрыОткрытия.Вставить("Родитель", Родитель);
	ПараметрыОткрытия.Вставить("ТекстЗаполнения", ИскомыйКлиент);  
	ПараметрыЗаполнения = Новый Структура("Основание", ПараметрыОткрытия);
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ДобавитьИВыбратьКонтрагентаЗавершение", ЭтаФорма);
	
	ОткрытьФорму("Справочник.Контрагенты.Форма.ФормаЭлементаКлиенты", ПараметрыЗаполнения,,,,,ОписаниеОповещения);
	
КонецПроцедуры  

&НаКлиенте
// Процедура - Добавить и выбрать контрагента завершение
// 
// Параметры:
//  Результат	 - 	 - 
//  Параметры	 - 	 - 
// 
Процедура ДобавитьИВыбратьКонтрагентаЗавершение(Результат, Параметры) Экспорт
	
	Если Не Результат.Пустая() Тогда
		Запись.Контрагент = Результат;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапонитьНаименование(ИскомыйКлиент)  
	
	ИскомыйКлиент.Наименование = ИскомыйКлиент.Фамилия + ?(ЗначениеЗаполнено(ИскомыйКлиент.Фамилия), " ", "") + ИскомыйКлиент.Имя + ?(ЗначениеЗаполнено(ИскомыйКлиент.Имя), " ", "") + ИскомыйКлиент.Отчество;
	
 КонецПроцедуры

&НаКлиенте
Процедура ЗапонитьПол(ИскомыйКлиент) 
	
	ПолКлиента = ОбщегоНазначенияКлиентПовтИспСтоматология.ОпределитьПолКлиента(ИскомыйКлиент.Фамилия, ИскомыйКлиент.Имя, ИскомыйКлиент.Отчество);
	Если ПолКлиента = "Мужской" Тогда
		ИскомыйКлиент.ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Мужской");
	ИначеЕсли ПолКлиента = "Женский" Тогда
		ИскомыйКлиент.ПолКлиента = ПредопределенноеЗначение("Перечисление.ПолФизическогоЛица.Женский");
	КонецЕсли;  
	
КонецПроцедуры

&НаСервереБезКонтекста
// Функция, возвращает группу клиентов.
//
Функция ГруппаКонтрагентов() 
	
	Возврат Справочники.Контрагенты.ПолучитьПапкуПоТипу(Перечисления.ТипыКонтрагентов.Клиенты);
	
КонецФункции

&НаСервере
// Процедура, устанавливает доступность элементов.
//
Процедура УстановитьДоступностьЭлементов()
	
	Элементы.ДекорацияЗаписьНаПрием.Доступность = ЗначениеЗаполнено(Запись.Сотрудник);
	Элементы.ФормаКнопкаСохранитьИЗакрыть.Доступность = ЗначениеЗаполнено(Запись.Сотрудник);
	// Элементы.ГруппаКнопкаСохранить.ЦветФона = ?(ЗначениеЗаполнено(Запись.Сотрудник), ЦветаСтиля.ЦветВажного, Новый Цвет(178,178,178));
	
КонецПроцедуры

&НаКлиенте
Процедура СотрудникАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИскомыйСотрудник = Текст;
	ДанныеВыбора = НайтиПодходящихСторудников(ИскомыйСотрудник);
		
КонецПроцедуры

&НаКлиенте
Процедура СотрудникОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДанныеВыбора = НайтиПодходящихСторудников(Текст);
	
КонецПроцедуры 

&НаСервере
Функция НайтиПодходящихСторудников(СтрокаПоиска)
	
	Если ПустаяСтрока(СтрокаПоиска) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =    
	
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
	|	НастройкиСотрудников.Сотрудник КАК Сотрудник,
	|	НастройкиСотрудников.Сотрудник.Представление КАК Представление,
	|	НастройкиСотрудников.Сотрудник.Код КАК Код
	|ИЗ
	|	РегистрСведений.НастройкиСотрудников КАК НастройкиСотрудников
	|ГДЕ
	|	НастройкиСотрудников.СтруктурнаяЕдиница = &СтруктурнаяЕдиница
	|	И (НастройкиСотрудников.ДатаУвольнения = ДАТАВРЕМЯ(1, 1, 1)
	|			ИЛИ НастройкиСотрудников.ДатаУвольнения > &ТекДата)
	|	И (НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.Врач)
	|			ИЛИ НастройкиСотрудников.Сотрудник.Роль = ЗНАЧЕНИЕ(Перечисление.РольПользователя.ГлавныйВрач))
	|	И НЕ НастройкиСотрудников.Сотрудник.ПометкаУдаления
	|	И (НастройкиСотрудников.Сотрудник.Фамилия ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Имя ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Отчество ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Наименование ПОДОБНО &СтрокаПоиска
	|			ИЛИ НастройкиСотрудников.Сотрудник.Код ПОДОБНО &СтрокаПоиска)";
		
	СтрокаПоиска = "%" + СтрокаПоиска + "%"; 
	
	Запрос.УстановитьПараметр("ТекДата", ТекущаяДатаСеанса());
	Запрос.УстановитьПараметр("СтрокаПоиска", СтрокаПоиска);
	Запрос.УстановитьПараметр("СтруктурнаяЕдиница", ПараметрыСеанса.ТекущаяСтруктурнаяЕдиница);
	
	Выборка = Запрос.Выполнить().Выбрать();
	СписокСотрудников = Новый СписокЗначений;
	
	Пока Выборка.Следующий() Цикл
		Представление = Выборка.Представление + " (" + Выборка.Код + ")";
		СписокСотрудников.Добавить(Выборка.Сотрудник, Представление);		
	КонецЦикла;
	
	Если СписокСотрудников.Количество() = 0 Тогда
        СписокСотрудников.Добавить(Неопределено, "Сотрудник не найден.");
	КонецЕсли;
	
	Возврат СписокСотрудников;
	
КонецФункции 

#КонецОбласти
